OGO12/src/Documents/УстановкаЦенНаРаботы/УстановкаЦенНаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНаРаботы</name>
  <registerRecords>InformationRegister.Прейскурант</registerRecords>
  <tabularSections>
    <name>Прейскурант</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>V_RABOT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>D_START</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

OGO12/src/Documents/УстановкаЦенНаРаботы/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//TODO: Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.ВзятьЦеныИзАГПС.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаАГПСКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "УстановкаЦенНаРаботы.Прейскурант";
	ПараметрыЗагрузки.Заголовок = НСтр("Ru = Получить Исторические цены");
	ПараметрыЗагрузки.ДополнительныеПараметры = новый Структура("Дата", НачалоГода(Объект.Дата));
	Оповещение = Новый ОписаниеОповещения("ЗавершениеЗагрузкиЦен", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаАГПСКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
КонецПроцедуры
&НаКлиенте
Процедура ЗавершениеЗагрузкиЦен(АдресДанныхВХранилище,ДопПараметры) Экспорт
	Если АдресДанныхВХранилище = Неопределено тогда
		Возврат
	КонецЕсли;
	ЗаполнитьТЧНаСервере(АдресДанныхВХранилище);
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьТЧНаСервере(АдресДанныхВХранилище)
	ЗагрДанные = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);
	Для Каждого строкаданных из ЗагрДанные Цикл
		НоваяСтрока = Объект.Прейскурант.Добавить();
		НоваяСтрока.ВидРабот = строкаданных.ВидРабот;
		НоваяСтрока.Цена = строкаданных.Цена;
		НоваяСтрока.D_START = строкаданных.D_START;
		НоваяСтрока.CODE = строкаданных.CODE;
		НоваяСтрока.V_RABOT = строкаданных.V_RABOT;
	КонецЦикла;
	Модифицированность = Истина; 
КонецПроцедуры
